{
    "info": [
        {
            "Kids Activities Nearby": "Yes"
        },
        {
            "Takes Reservations": "No"
        },
        {
            "Delivery": "No"
        },
        {
            "Take-out": "Yes"
        },
        {
            "Accepts Credit Cards": "Yes"
        },
        {
            "Accepts Apple Pay": "Yes"
        },
        {
            "Good For": "Lunch, Dinner, Late Night"
        },
        {
            "Parking": "Private Lot"
        },
        {
            "Bike Parking": "No"
        },
        {
            "Good for Kids": "Yes"
        },
        {
            "Good for Groups": "Yes"
        },
        {
            "Attire": "Casual"
        },
        {
            "Ambience": "Casual"
        },
        {
            "Noise Level": "Very Loud"
        },
        {
            "Alcohol": "Full Bar"
        },
        {
            "Best Nights": "Wed, Fri, Sat"
        },
        {
            "Outdoor Seating": "No"
        },
        {
            "Wi-Fi": "No"
        },
        {
            "Has TV": "Yes"
        },
        {
            "Caters": "No"
        },
        {
            "Has Pool Table": "No"
        }
    ],
    "ratings": "2.5",
    "website": "https://www.daveandbusters.com/locations/braintree",
    "working_hours": [
        {
            "Mon": "11:00 am - 12:00 am"
        },
        {
            "Tue": "11:00 am - 12:00 am\n        \n                Open now"
        },
        {
            "Wed": "11:00 am - 12:00 am"
        },
        {
            "Thu": "11:00 am - 12:00 am"
        },
        {
            "Fri": "11:00 am - 1:00 am"
        },
        {
            "Sat": "11:00 am - 1:00 am"
        },
        {
            "Sun": "11:00 am - 12:00 am"
        }
    ],
    "name": "Dave &Buster’s",
    "claimed_status": "Claimed",
    "url": "https://www.yelp.com/biz/dave-and-busters-braintree-3?osq=Dave+and+Busters",
    "longitude": "-71.023488",
    "reviews": [
        "This is the second time I've taken my two children here this time it was for my sons birthday it was Tuesday January 29th at about 6 pm when we arrived . The waitress was awesome my Friend drinks water like a camel and she just kept coming with more and more water without my friend having to say a word . The food was really good my steak salad was good everyone ate their whole meal . It was a nice quiet night we went up to buy another game card and the manger introduced himself and said if we needed anything to let him know",
        "Unfortunately, this is a very small D&B and you are unable to use promotions on wednesdays here due to not being able to use multiple offers at once. The Woburn one allowed us to use coupons on a wednesday, so that was a bit disappointing. ",
        "This D&B is quite a bit smaller than the other D&Bs, but still has a few shooting games, racing games, and claw games.",
        "Haven't had time to write this review but my friend and I dined here some time ago and had the most amazing service. ",
        "We got the chicken sandwiches and when they came out my friends was a bit inedible and burnt. When we alerted the waiter he immediately apologized and took it back to be redone. We didnt want anything more than that but he had the manager come out and let us know that he would be comping both our meals since we had to kind of watch each other eat. It was completely unnecessary but we were very impressed by the service. The dessert we got was also AMAZING! The brownies were so fudgey and delicious with the vanilla ice cream.",
        "Went here this past Wednesday w/ a group of friends & we had a great time! There are tons of options for games to play & a surprisingly great restaurant w/ a full bar. I got chicken tacos which I highly recommend. Great place for a casual night out",
        "Blonde bartender yesterday evening (Saturday 20th) did not put alcohol in the patron margaritas we ordered, just gave us the mix. Also was ignoring a lot of people at the bar.",
        "I would only come to Dave & Buster's for their arcade games, NOT the food. Maybe their drinks, but never the food unless you're drunk already. Dave & Buster's is the place before OR after a wonderful meal somewhere else.",
        "The arcade is more bang for your buck if you go during Wednesdays, when all the games are half priced! There's a wide variety of games for anyone: Flappy Bird, Wheel of Fortune, Deal or No Deal, Basketball, Beer Pong, Mario Kart, Pacman, choices of shooting games, a decent amount of cane machines, Angry Birds, Connect 4, skeeball, and the list goes on!",
        "Every time I visit on a Wednesday, the place is PACKED. There's going to be kids running around until 10 PM when they finally restrict D&B for just 21+ adults. D&B often has hosted events especially birthday parties in reserved spaces upstairs.",
        "Overall, just come for the arcade and games! Please don't bring a date here for the food. And for the kids, McDonalds might be a better option beforehand. Just PLAY!!",
        "I want to begin this review by saying we went into dinner realizing that this is a restaurant that has an arcade as its main attraction and we adjusted our expectations from there. Our main goal was to have some bar food and a few drinks then play some silly games.",
        "Our biggest issue was the drinks. It took at least 35 minutes for them to come and they finally arrived after our dinner came. Our waitress repeatedly told us she was waiting for the bar to make them and eventually said the ticket was lost and they would be out shortly. One drink never arrived but was on the bill and had to be removed. During this time our waters were never refilled. The manager walked by repeatedly and didn't inquire about our meal or experience.",
        "The food was inconsistent. The dip trio came out lukewarm. Two people in our party had mediocre meals (the chicken tacos and the mini quesadillas were cold) My chicken fingers however were very good and both people who ordered burgers liked them.",
        "We were so irritated by the end of the meal we decided to just leave rather than stay for the games. Our waitress was at no point unpleasant but she was completely disinterested in her job. Not once was an apology offered for the long wait. In the future we will be eating dinner somewhere else before going to use the arcade.",
        "It's Sunday afternoon approximately 1420 I'm standing inside Dave & Busters with about 25 people in line and one person at the front counter. That's interesting when they're trying to get people in, but you have to wait 15-20 min. Just to get in.",
        "Honestly I enjoy this establishment as it's a fun enjoyable place to play games bringing me back to my adolescent days. However recently I was disappointed to see the staff\\'s lack of respect of my children. To make it worse my kids genuinely enjoyed this place along with myself but were turned off as they felt uncomfortable and to embarrassed to play any games as my younger son told me as we left the parking lot. I write this not to ruin the business's reputation but merely to strengthen its image. Please Dave and Busters show your customers you listen.",
        "I have been to dave and buster's plenty of times. Me my boyfriend and my friend decided to go to Dave and Busters on a Friday night. We decided to go a little after 9pm sincd the little kids will not be there. It was fun playing all the arcade and driving games. The basketball hoop game was also good too. We were there for about maybe 2.5 hours, you do not imagine how long you are there for until you realize how.much fun you are having. With having fun it does come with spending.more money. We probably kept reloading the card 5 times or more. I actually lost track but overall a good fun places to go fof kids and adults.",
        "Tonight was one of the worst experiences. I came here with 4 of my friends to get food and play games. Well that didn't happen... we waited an hour for the waitress to tell us they lost a bunch of tables and have to remake our food. It wasn't busy at all. We ordered many drinks that took too long, or we didn\\'t get our drink at all. The manager came and apologized for everything, and when he did I asked him to get the coffee my friend asked for 3 times and I didn't see the coffee or the manager after thatWhen we finally got our food, it was STILL COLD and didn't have time to buy a card or play games. Extremely pissed off.",
        "I come here every Wednesday with 3 other people and spent close to $200 for food and games but yesterday my friend took her 2 y.o daughter and we came at around 9:15 sat for 10 mins at a table no one came over so I flag down someone and she saw us and walk the other way and finally 5 mins later someone came but she said we have to leave we can't eat because it's curfew time. We wasted 15 mins waiting and got reject service at 9:30.",
        "The place is immaculate and has great games. I do wish the prices would be slightly more affordable or the games ran longer. Me and my cousins have been several times and will be back. Thanks for the great time again today.",
        "Hanging with my cousins playing games. #daveandbusters #braintreema",
        "Last night we went to Dave and Busters around 9:30 to go play some games and grab a drink with friends. I went into the bathroom and I was completely disgusted at the lack of upkeep, and I had to go to 3 stalls to find toilet paper. Then when I washed my hands only one dispenser had paper towels. I notified a manager, I informed him that the bathrooms needed attention as well as toilet paper and towels. He apologized and told me he'd send someone in to take care of it. About an hour later I went back in and they had added towels and toilet paper but the place was still disgusting and the following photographs are how this person added paper towels and toilet paper to the bathroom... we had fun playing the games even though it's very expensive to play them and we left with a candy bar prize. But clean the damn bathroom.. gross.",
        "I took my three kids to Dave & Buster's, they had a amazing time playing games, unfortunately my youngest son's hamburger and fries were cold. And we waited almost 10 mins for a waiter to come, until my husband walked over to the bar. Finally a employee came to serve us. Sadly our son (the youngest) tripped on one of the game and fell right in front of of one of you employees. She was silent as a mouse on her phone. I am very disappointed. We have been coming here for years and love the smiles this place brings our children.",
        "Play the games and skip the food. Stick with nachos or something that doesn't involve meat products. My chicken was rubbery and scary. I believe it must have been frozen and cut after it barely made it out of the microwave ! Yikes",
        "It's a game place for teen kids and young 22 year old to go play cheesy arcade games.",
        "Doesn't look good in the TV commercials... really doesn't look good when you're there with a thousand screaming kids and wicked loud music.",
        "I've only eaten here once by the bar. It wasn't bad for a Saturday night. Not overpacked with people.",
        "Games are solid... I've been seeing more live app games there which I like. They have games for also all age ranges (5+).",
        "The place is spacious, bathroom were clean. Solid game spot... not too sure if I would go here just to eat though.",
        "Waited over an hour for food it was only 2 plates definitely not worth it if you are going to eat and play your better off stoping at the unos next door to eat first. The manager walked by several times and didn't even think to ask us how our experience was.",
        "All of the staff were really nice to me. I never received an attitude from any of them. The games are not too expensive and the food wasn't bad. In my opinion, I think the prices for the food is in the average range. The bartenders are attentive and they can tell when you want to be left alone. I love that it's open late at night and I can go there while everything else is closed."
    ],
    "phone": "(781) 519-7900",
    "address": "250 Granite St Ste 1908 Braintree, MA 02184",
    "latitude": "42.218977",
    "ratings_histogram": [
        {
            "5 stars": "24"
        },
        {
            "4 stars": "57"
        },
        {
            "3 stars": "64"
        },
        {
            "2 stars": "62"
        },
        {
            "1 star": "100"
        }
    ],
    "price_range": "$11-30",
    "health_rating": "",
    "category": "Bars,Arcades,American (Traditional)"
}
