{
    "info": [
        {
            "Accepts Credit Cards": "Yes"
        },
        {
            "Accepts Apple Pay": "No"
        },
        {
            "Accepts Google Pay": "No"
        },
        {
            "Accepts Cryptocurrency": "No"
        },
        {
            "Wheelchair Accessible": "Yes"
        },
        {
            "Wi-Fi": "Paid"
        },
        {
            "Dogs Allowed": "No"
        },
        {
            "Open to All": "Yes"
        }
    ],
    "ratings": "3.5",
    "website": "https://www.marriott.com/setSCtracking.mi?scid=dfedf519-6161-4ae6-be84-577f767ed579&mid=/hotels/travel/BOSLW",
    "working_hours": [
        {
            "Mon": "Open 24 hours"
        },
        {
            "Tue": "Open 24 hours"
        },
        {
            "Wed": "Open 24 hours\n        \n                Open now"
        },
        {
            "Thu": "Open 24 hours"
        },
        {
            "Fri": "Open 24 hours"
        },
        {
            "Sat": "Open 24 hours"
        },
        {
            "Sun": "Open 24 hours"
        }
    ],
    "name": "Boston Marriott LongWharf",
    "claimed_status": "",
    "url": "https://www.yelp.com/biz/boston-marriott-long-wharf-boston-3?osq=Marriott+Hotels",
    "longitude": "-71.050773",
    "reviews": [
        "Amazing experience I'd like to share that went above and beyond my normal hotel experience.",
        "Weekend with our son to celebrate his birthday and upon check in he made the front desk agent aware of this (6) She asked him his name and said happy birthday. That evening a knock at the door by a room service attendant bringing us cookies and milk and a birthday card from the kitchen staff. This made his night. Additionally since our stay here last year the rooms have been updated. Clean and crisp decor.",
        "Very happy for a very picky traveler.",
        "Room was nice. Overlooking the harbor",
        "Service was great. There are renovations being done. Someone is greeting ppl on the 2nd level.",
        "This place was LOUD. All through the night and into the early morning, you can hear footsteps, voices, doors slamming. Kids in the hallway. I didn't get any sleep.",
        "I'll be back during the warmer months. Probably water taxi from my house (because parking downtown can be up to $60 per day). This was a perfect location, just bad timing. I'll give it another go",
        "The quick and dirty of it is this: most of the staff here are pleasant and lovely, but the facility is need of a MAJOR renovation.",
        "I'm really Boughie when it comes to hotels and this place definitely did NOT meet the mark. Why? Because: walls have water damage, paint is cracking and the carpet looks like gramma's house.",
        "Came here for business and honestly couldn't wait to leave. Unfortunately, I was working under a tight crunch and booked this place as it was closest to my business meetings.",
        "While the Fin Point Restaurant downstairs gives off a very sexy and chic vibe, that is not matched once you enter your suite. The first room they put me in had a major crack down the wall because of obvious water damage, and I expressed to the staff that I wasn't happy about it. They were very apologetic and moved me to another room, which was better, but still looked old, basic and again - in need of a major renovation. P.S. I do think they could also improve on their lost and found practices here. I lost a favorite hat of mine in the restaurant downstairs and I don't think the staff did enough to look for it. I had a flight to catch back home so I couldn't do my own investigation, but if I ever came back to Boston, I'd come back here to look for my hat - and choose to stay at another hotel for the night.",
        "This hotel is in the perfect location. It's also very comfortable with big rooms and right on the water. They have a great gym and rooftop pool that overlooks the harbour. I always stay here for work and won't stay anywhere else!",
        "Best turn down service ever. Well done!!",
        "I stayed here on a 3 day business trip and found this property to be just right. First, it is centrally located - right near the aquarium and a reasonable walk to most tourist attractions (I managed to get in a little sight-seeing). I've read that parking is very expensive; I took a cab there and an Uber to the airport at the end of my trip; I didn't need an Uber or a car for that matter during my stay. My meetings were about a 10-15 minute walk away, but it was an easy walk.",
        "The hotel itself is very large, so I would recommend asking to see a map to locate your room; my room was a corner (which I prefer) and was about a 5 minute walk to the bank of elevators. Rooms are updated, comfortable, and rates were reasonable for a major city and a top-tier hotel.",
        "Location, Service, Cleanliness and Comfort!",
        "We stayed here on a recent trip to Boston. When we first arrived, we were greeted by the doorman. He recognized that we were checking in to our hotel room and guided us to the front desk. He also called them while we were on the way up the escalator so they were ready. Perfect, seamless service.",
        "Our check in was prompt and we were quickly in our room that had an outstanding view and one of the most comfortable hotel beds I have ever slept on.",
        "Over the next few days, we continuously talked about how ideal the location of this hotel is. We were walking distance to everything!!!",
        "The staff was always friendly and our room was always taken care of. I am a platinum member at Marriott and this was one of the better experiences I've had. Tip: this hotel is a short water ferry ride to the airport. Avoid the taxi and Uber! The front desk can arrange the water ferry. It's worth it.",
        "We are currently visiting from the west coast, so the time difference has been an adjustment. I LOVE that you can order a meal 24/7 here. The food was ready very quickly and was delicious. I was able to order through their app. I then was able to pick up and eat it downstairs. This allowed the rest of my family to keep sleeping while I got so much needed dinner. The front desk associate was extremely friendly and helpful with getting my order. This was early Saturday morning March 30th 2019 around 2am. Chicken Caesar salad and a Pepsi",
        "Really nice hotel in a great part of town. Stayed here for two nights in late Nov. 2018 for a work meeting, and despite the street noise, even though I was on the top floor, I slept pretty well. Staff was nice, the lobby was nice with large, beautiful Christmas tree in the middle, and the bar staff was super cool and fun to chat with. ",
        "Typical Marriott, with all the basics, but the room seemed to have been renovated, so they were nice and modern looking. Also had a fridge in the room along with a Keurig machine, although I opted for Starbucks nearby instead. Not a fan of hotel room coffee.",
        "My only beef, and I couldn't figure out what it was until I walked out of the hotel on the second day, is the beeping sound coming from the parking structure as cars are exiting. If people are coming and going late at night, you definitely hear it no matter how high up you are, if you are facing the harbor. Would definitely stay here again, though at a different time of year when it's a bit warmer!",
        "Great rooms, fantastic bars, ideal location and perfect service. Couldn't ask for much more. Would stay here over the Envoy or other upcoming hotels in the general area for the future since I travel into the city quite a bit. Can get pricey per night though",
        "Room is super clean and updated. Beds are really comfortable and I really like the smart TVs. Only complaint is that the rooms around the atrium by the elevators are SUPER. Loud. You can basically hear the conversations of people at the bar from the 5th floor. Also walls are super thin. Felt compelled to say bless you when my next door neighbor kept sneezing.",
        "Would have given this hotel a 5 star rating if it wasn't for the air conditioning. We stayed during June and the rooms have motion activated ac, once I went to bed there wasn't enough movement in the room to keep the ac on. Woke up multiple times in sweat. Other than that this place is five stars. Very upscale and beautiful inside and out. Staff is extremely friendly and provide a wonderful experience.",
        "Well-designed rooms, kind and friendly service from each staff member I interacted with, and an excellent location near the Boston Aquarium. I was impressed with what must be a pretty recent renovation. The rooms are beautiful, and the lobby and meeting facilities are all modern, clean, and well thought out. Plenty of places to work and have conversations. The pool and gym are also far better than the average hotel pool and gym. I'm really impressed by the level of courtesy and hospitality that the staff show here. All of these together make for a 5-star rating.",
        "We stayed at the Long Wharf Marriott this past weekend with some friends. It was quite easy to get to off the highway and very close the the aquarium, Quincy Market, and the North End. It was recently renovated which was nice. Rooms were beautiful and very clean. I asked for a room close to the elevator due to having a broken foot, and was given a room at the furthest point in the hotel, but we did not complain as they were able to accommodate us with early check in. Our room was ready at noon, instead of 4pm. Just beware of the cost of breakfast. The buffet is $29 per person. I ordered off the menu, while my boyfriend got the buffet. It was $67 for breakfast with a tip... and it was not that good. $6 for a pot of coffee. Other than breakfast, I would definitely stay here again!",
        "I enjoyed my stay at this Marriott. The staff are friendly and helpful. If you forgot your toothbrush, they have one for you. Rooms are up to date with your typical amenities (TV, coffee, iron and iron board, wifi, etc.)', 'The beds are pretty comfortable. I got a goods night rest. ', 'Note: Valet parking ($55 overnight) is next to hotel. The self parking ($40 overnight) is about a block away.",
        "First off this is a great location, literally on the wharf right on the water. It's also walking distance to decent bars and restaurants. I was here for work and was pleasantly surprised by this place. The staff was also friendly and accommodating. I was here right before the 'bomb cyclone' blizzard and was lucky enough to land an early flight before it hit. This was last minute and cut my stay short by a day. The front desk didn't even blink when I let them know less than 12 hours before I would be checking out early and they did not charge me for the additional night. Thumbs up! The rooms were nice and the bed comfortable. While the place is a little dated overall, it was very clean and well kept and with the great location, I would stay here again.",
        "While spending the day in Boston with my family, we used the valet services at the Marriott to park our car while we explored the Long Wharf area and got lunch. Prior to parking our car we had placed some items in the trunk with our luggage. We spent a few hours wandering and then came back and the valet got us our car. ', 'This was our last stop before the airport. We left from the hotel parking garage to head to the airport and when we dropped off the rental car, we opened the trunk to find half of our bags missing! We immediately called the hotel to ask if they could review the security footage. Considering that we had used a valet and our car was in their care, we thought this was a reasonable request. The employees were no help at all. They refused to share the security footage and offered few resources and support for the theft of our luggage. We had our luggage right before we parked in the parking garage and once we left the parking we immediately went to the airport. Our luggage had to have been stolen while our car was in their care and they are offering no assistance. I would not trust the security of this hotel. Whether you park here or stay here, this horrible service demonstrates a complete disregard for customers' safety and security. I am absolutely appalled at the lack of support and the amount resistance we faced trying to get assistance with this issue.",
        "Get out of the hospitality business...you don't deserve to be there!!! I'm a platinum elite member and you can't ensure my room is cleaned when I'm back in my room by 3:30 pm...and when I inform the reception that it hasn't been done and request that it happens from 6:30 pm onwards when we're stepping out and they assure us it will be done, when we get back at 10 pm...guess what, it's still not done!!! Disgraceful...get out of the hospitality business...you don't deserve to be here. Worst service ever.",
        "Very nice hotel located in a quieter section of Boston, just a little walk away from Fanueil Hall, Boston Commons, and the Boston Massacre site. Lots of nice restaurants around, and right by the waterfront which is decorated with lights around Christmastime. The hotel has a very nice indoor heated pool and a nice gym as well as a starbucks and bar and grill inside. My room, however, had a very strange view of a wall. Yes, if you opened the curtains by my bed there was a literal wall directly behind it. A little unsettling, but overall the room was clean and comfortable.",
        "Is this a really bad hotel? No. Does it deserve a good rating? Definitely not! Let's get one thing straight, the LOCATION of this Marriott is wonderful! It's close to so many things. That's about the only positive. Funny thing, the pros actually add to the cons. Because it's so close to everything... the hotel is extremely crowded and loud with people at all times. So very touristy! The parking is $55 for valet. You do have other nearby options, but with the hotel valet you have in and out privileges. The hotel itself is ok. It's nice, but clearly very dated. The lobby hides it a bit, but when you get to the hallways and rooms upstairs... it's like a 1999 Marriott. Pool is cool (view) and the gym is actually quite impressive for a hotel one. Breakfast? Not on weekends... are you kidding me? Is this Marriott stay-able? Sure if you don't mind burning money, but there's nothing special about this Marriott. I'd go elsewhere if I could. Save some money, pay less for parking, don't deal with the crowds, and enjoy yourself elsewhere. I won't be back!",
        "View from a room, not bad.",
        "This is a very clean and spacious Marriot. Our room is awfully spacious, including two beds(queens), a meat and elaborate bathroom, and still carpet space left over! It is also supplied with a coffee machine(Keurig), a safe, and a cooler. Overall, I would definitely come again!"
    ],
    "phone": "(617) 227-0800",
    "address": "296 State St Boston, MA 02109 b/t Atlantic Ave & Long Wharf Waterfront",
    "latitude": "42.360163",
    "ratings_histogram": [
        {
            "5 stars": "75"
        },
        {
            "4 stars": "74"
        },
        {
            "3 stars": "32"
        },
        {
            "2 stars": "32"
        },
        {
            "1 star": "27"
        }
    ],
    "price_range": "Pricey",
    "health_rating": "",
    "category": "Hotels,Venues & Event Spaces"
}
