{
    "info": [
        {
            "Takes Reservations": "No"
        }, 
        {
            "Delivery": "No"
        }, 
        {
            "Take-out": "Yes"
        }, 
        {
            "Accepts Credit Cards": "Yes"
        }, 
        {
            "Accepts Google Pay": "No"
        }, 
        {
            "Good For": "Lunch, Dinner"
        }, 
        {
            "Bike Parking": "Yes"
        }, 
        {
            "Good for Kids": "Yes"
        }, 
        {
            "Good for Groups": "Yes"
        }, 
        {
            "Ambience": "Casual, Trendy"
        }, 
        {
            "Noise Level": "Average"
        }, 
        {
            "Alcohol": "Beer & Wine Only"
        }, 
        {
            "Outdoor Seating": "No"
        }, 
        {
            "Wi-Fi": "Free"
        }, 
        {
            "Has TV": "Yes"
        }, 
        {
            "Waiter Service": "No"
        }, 
        {
            "Drive-Thru": "No"
        }, 
        {
            "Caters": "No"
        }
    ], 
    "ratings": "3.5", 
    "website": "https://www.shakeshack.com/location/boston-seaport-boston-ma", 
    "working_hours": [
        {
            "Mon": "11:00 am - 10:00 pm"
        }, 
        {
            "Tue": "11:00 am - 10:00 pm"
        }, 
        {
            "Wed": "11:00 am - 10:00 pm\n        \n                Open now"
        }, 
        {
            "Thu": "11:00 am - 10:00 pm"
        }, 
        {
            "Fri": "11:00 am - 10:00 pm"
        }, 
        {
            "Sat": "11:00 am - 10:00 pm"
        }, 
        {
            "Sun": "11:00 am - 10:00 pm"
        }
    ], 
    "name": "ShakeShack", 
    "claimed_status": "Claimed", 
    "url": "https://www.yelp.com/biz/shake-shack-boston-2?osq=shake+shack", 
    "longitude": "-71.046632", 
    "reviews": [
        "Taste- the burgers are always fresh and juicy and delicious Very flavorful burgers Well seasoned Crinkle cut fries r always crispy not that soggy soft crinkle cut u get in a school lunch The hot chicken sandwich was new for me and that was good had a nice kick to it Service- was great the girl taking orders has a cast and she hopped on 1 leg over to get refills while the other staff members were busy getting orders (I felt so bad) she should be employee of the month Value-the food is a bit small for the price Fries were $5 Burgers start at 5-6 bucks And are on the smaller side Like a kids burger but wat tastier lolPresentation- they wrap them in wax paper and the fries come on the little boats and everything is on a metal baking sheet lined with wax paper very cool Overall- I love this location it's still busy but not as crazy as some locations", 
        "I found it quite clean actually and the staff was great especially the mvp at the front",
        "A real nice location that's constantly busy and fresh.",
        "This was my first experience to a Shake Shack and it was really good. Sure, it's a little chaotic when it gets busy and the line is not in a good form, but the rest of the experience is pleasant.",
        "Waited in line during a busy convention weekend with friends to try Shake Shack for the first time and get some lunch.",
        "We waited in line for about 10-15 minutes before ordering, and then another 10-15minutes for all of us to get the food (3 different orders)",
        "Everything was delicious, fresh and amazing. Probably one of the best chicken nugget type things I've ever had at a fast food chain. My boyfriend raved about the burger for hours on how good it was and the bacon cheese fries were perfect.",
        "Loved this place and I highly recommend to try any location just to experience it once.", 
        "Lemonade, burger and bacon cheese fries",
        "1) Order food, receive buzzer 2) wait 10 or so minutes 3) buzzer goes off 4) arrive at pickup counter with a line of other people whose buzzers went off 5) Wait another 10 minutes or so 6) catch attitude from staffer, who reveals buzzer actually doesn't mean food is ready 7) eventually receive food", 
        "Good food, nonsensical service system.",
        "First timer here! It was good - love my burger and fries and I felt better going here than majority of fast food places. I got the Shake Shack Double and while I normally don't order a double I really enjoyed the size and how delicious it was. Their fat-to-meat ratio was delicious paired with that goey slice of cheese (I preciously watched an episode on bon apetit on how to make this burger so it gave me a greater appreciation for it!) you also cannot bear antibiotic free meat!",
        "I highly recommend finishing with a shake/custard. My favorite is the salted caramel - sooooo good.",
        "They must have been having a good day on the day that I went because it didn't take long for my food to be ready at all. The system is as described though; the buzzer goes off before they fix your food but it didn't take long for them to fix it. This place was recommended by a coworker. She hyped it up so much I may have been expecting a bit more from it. Nothing really seemed extraordinary. Standard burger, bun, bacon, cheese, condiments, fries... cheese sauce for the fries was not so standard. My coworker likes the cheese sauce and said it was 'everything.' It was alright. It gave me the cheese and crackers snack pack vibe after it hardens shortly after it is pumped onto the fries. All in all it was a pleasant experience.",
        "Cheese fries and smoke shack",
        "I like Shake Shack's burgers, shakes and fries but I don't feel they are all that healthy. The fries in particular are very greasy. The price is comparable to some healthier and better made burger options so I don't go here all that often.",
        "First time here. Stopped in after the flower show for a quick bite. I was not disappointed! The burgers tasted amazing, were juicy and best of all normal size!! I wasn't expecting much since you order at the counter but the service was quick and friendly. The only downside (for the customer not the restaurant) was the seating. It was packed so you had to grab a table as soon as someone got up! Think cafeteria style",
        "Overall I would definitely eat here again!",
        "Slow slow slow and full of mistakes. Easily the worst Shake Shack I've ever been to. Waited almost half an hour for a fairly simple order. Missing whipped cream on one shake, whipped cream on the other shake had sat for 20 minutes and was totally flat. Also they forgot one shake for a full three out of three bad on the shakes. Was it busy? Yes. But no more so than other major metro Shacks I've been to. The one near Times Sq in NYC is far busier and not like this.",
        "That's whipped cream!?!",
        "I don't know why they only have 3.5 stars here but maybe I'm bias because I freaking LOVE Shake Shack.", 
        "In the area for a conference and it's a moderate walk from the convention center (15 min). Gets pretty packed at peak lunch time but the crew does a great job of getting the line moving and food out of the kitchen quickly.",
        "My favorite is their classic Shack Burger or cheeseburger. You can add pickles and onions to it but I think it's good without the add-one; as designed. Fries are the bomb. Lemonades are refreshing and delicious. Staff is efficient and friendly. Tables are cleaned after patrons leave. Awesome location.",
        "I tried ordering for the first time using their app and accidentally ordered from the wrong location. Tried calling the location but they weren't able to get to the phone so I asked the cashier at the correct location. She immediately placed my order and called the other location to cancel the order. Food came out immediately after. THAT'S WHUDDUP.",
        "Love.",
        "Shack burger looking sexy as shiet",
        "Shack burger with pickles and onions added on (think it's better just classic style)",
        "Really love this... it's like spanx for burgers... holds everything in",
        "This place has a fun, trendy feel to it. I purchased a marshmallow chocolate chip shake, cheese fries, and burger. ",
        "From order to eating, it was 35 minutes. ",
        "The shake was the 'star' of the event (though a b-rate star) with a yummy flavor and consistency. It came last, so I was glad to have it 'save the day,' so to speak. ",
        "When I bit into the burger, all I could taste was the 'charcoal' of over-cooked breading. After eating just half of that sandwich, I moved on to my fries. They were disappointingly cold, including the cheese. ",
        "At a $25 price tag for a 2/3 failure, I do not see value in purchasing their food again.",
        "I'm not a huge fan of fast food. Wait. Let me rephrase that. I'm a huge fan of fast food but I'm not supposed to be.",
        "At least according to my wife. ",
        "While in town speaking at a conference nearby, I found myself looking for something to eat that was pretty quick since it was in between tracks at the conference. ",
        "I stood in line staring at the menu for a minute or two and then walked up to the woman behind the register and ordered. As soon as I placed my order everyone in front started high-fiving and laughing. Apparently they had a bet on what I would order and somebody got it right. ",
        "So, we all had a good laugh about it. After all, it was pretty impressive. And then I sat down and waited for about 5-10 minutes for my food. ",
        "Unlike most fast food places, what I ordered can out fresh. The fries were hot and the chicken sandwich looked a lot like the picture. ",
        "And holy cow...or holy chicken I guess...it was good! Really good! In fact, it was so good I came back the next day!!!",
        "We don't have a Shake Shack near me in Tampa, but as soon as we do, I'm going back!", 
        "What a HORRIBLE HORRIBLE LOCATION! If you are out of town or in car DON'T BOTHER going to this one.", 
        "Besides the fact this place IS Extremely Slooow....",
        "There's absolutely NO where to par even though in the street around the corner that has about 30 spots they're all reserved for lord know who or you will be towed...",
        "Leave it to the Genius's of Boston to come with this brilliant idea!",
        "Shake Shack is Shake Shack, meaning if you like burgers and fries you'll more than likely really enjoy it. I wouldn't say it's the best burger in the world (dem are fightin' words, I know) but it's good!",
        "Wow. Such a great experience on a warm Boston night. Burger was perfectly cooked. ",
        "Charred on the outside and soft and flavorful on the inside. ",
        "Bun is a soft potato bun with fresh lettuce and tomato. ",
        "The fries are the star of the meal. Crispy, crinkle cut with a beautiful twice fried finish. ",
        "Plenty of seating at this location.",
        "Great experience.",
        "It's summer and those BBQ burgers and bbq brisket fries are to die for. Pro tip- ask for extra cherry peppers.", 
        "This location in Seaport is awesome- clean, spacious and service is fast. Staff is super friendly too.",
        "Chick'n Shack, Fries and a Raspberry Ginger Lemonade perfect for a summer picnic.",
        "Went to Boston for the weekend with a group of friends to celebrate some of our birthdays and ended up coming here for a meal one afternoon. It was the first time my husband and I had been there so of course we had to get everything! We got cheese fries, burgers, drinks and shakes- soooo good. I wasn't sure if I was going to like the signature sauce, but it was delicious! The place was jam packed but we were able to find a table, get our food quickly and enjoy our meals. Definitely recommend!",
        "I've grown to like Shake Shack.",
        "Sure, it's not the cheapest, but for a fast food plus burger joint, it's not bad. Food is tasty, and that's what matters most. The burgers are enjoyable. Their fried chicken sandwich is probably the best item on the menu. Their crinkle cut fries are basically perfect. Even their Chicago-style hot dog hit the spot.",
        "Great for a casual meal.",
        "This was my first visit to a Shake Shack. The chicken sandwich was amazing and very crispy. Cheeseburger was good but I would get the double next time. Frozen chocolate custard is not the best I have had but it is better than no custard. This place was right next to my hotel so very convenient. The staff was very nice. Overall it was very good.",
        "Great addition of an awesome chain to the growing neighborhood in Seaport. It was a welcome change to the Seaport food scene a year ago as my office was one of the first to move in back in 2016 which meant no quick lunch spots. This location has your full range menu of burgers, dogs, shakes, and alcohol. Service is always top notch and the burger is as consistent as any location in New York. ",
        "Tip: Order online if you can for lunch as it does get busy during the weekdays.",
        "I mean, who doesn't love Shake Shack? The burgers are so tasty! The line was really long, but went pretty fast. It took a while for the 3 of us to get our food after.",
        "This location doesn't seem as clean as the other ones I've been to in DC, NYC, and Austin. The condiment station was a hot mess. But, the food was good as always so 4 stars it is."
    ], 
    "phone": "(617) 337-4699", 
    "address": "77 Seaport Blvd Boston, MA 02210 at Northern Ave Waterfront, South Boston", 
    "latitude": "42.352066", 
    "ratings_histogram": [
        {
            "5 stars": "32"
        }, 
        {
            "4 stars": "41"
        }, 
        {
            "3 stars": "23"
        }, 
        {
            "2 stars": "21"
        }, 
        {
            "1 star": "20"
        }
    ], 
    "price_range": "$11-30", 
    "health_rating": "", 
    "category": "Hot Dogs,Burgers,Ice Cream & Frozen Yogurt"
}
